{
    "users":[
        {
            "id": 1,
            "name": "Ely",
            "email": "Ely@gmail.com"
        }, {
            
            "id": 2,
            "name": "Val",
            "email": "Val@gmail.com"
        }, {
            
            "id": 3,
            "name": "Cheryl",
            "email": "Cheryl@gmail.com"
        }
    ],
    "posts": [
        {
            "id": 1,
            "title": "Green Chile Enchiladas",
            "userId": 1,
            "ingredients": "2 8 count packs flour or corn Mission Tortillas \n 2lbs of cooked chicken breast \n 8oz of creamcheese \n 28oz can of Green Chile Enchilada Sauce or make your own! \n 1 pack of taco seasoning or make your own! \n 2 cups of Monterrey Jack cheese",
            "body": "Preheat the oven to 350 degrees \n Cook the chicken, if not already cooked, in a medium saucepan \n Add the pack of taco seasoning or your homemade mixture \n Add the pack of cream cheese to the chicken and let it slowly melt and get warm \n When the chicken mixture is warm and mixed together well, \n Divide the chicken evenly among all 16 tortillas and roll tightly \n Place the tortillas seam side down into a casserole dish lined up, touching each other in the pan \n Place that dish in the oven and cook until the tortillas are a light golden brown, about 10 minutes \n Once golden brown and slightly 'crispy', remove from oven \n Pour the whole can of enchilada sauce evenly over all the tortillas,  \n making sure to cover the tops of the enchiladas and the bottom of the pan \n Sprinkle cheese over top of the enchiladas evenly \n Bake again until cheese is melted and sauce is warm, around 20 minutes",
            "description": "These chicken enchiladas are a simpler version of traditional style enchiladas, a delicious option to satisfy that weeknight craving!",
            "cuisineId": 1
        }, {
            "id": 2,
            "title": "Spanish Rice",
            "userId": 2,
            "ingredients": "2 cups of long grain rice \n 1/8 cup vegetable oil \n 8 oz tomato sauce \n 1 tsp salt \n pepper to taste \n 1 tsp minced garlic \n 4 cups of hot water \n 1 cube of chicken flavored bouillon \n dash of cumin",
            "body": "Heat oil in a large skillet on medium heat \nAdd rice, after it has been washed and drained, and cook until golden brown, stirring constantly \n Add the bouillon cube to the 4 cups of hot water, and add to the pan \n Add the tomato sauce, garlic, cumin, salt and pepper to taste \n Stir and cover the pan. Let simmer for 30-40 minutes or until there is no liquid left and rice is cooked \n Fluff with a fork before serving \n ",
            "description": "A great addition to level up any Mexican dishes",
            "cuisineId": 1
        } ,{
            "id": 3,
            "title": "Hawaiian Sliders",
            "userId": 3,
            "ingredients": "1 package of Hawaiian rolls \n 3/4 pound of cooked deli honey ham, thinly sliced \n 1 package of Swiss cheese \n 1/2 cup of unsalted butter \n 1 tsp of Worcestershire sauce \n 1 tbsp Dijon mustard \n 1 tbsp poppy seeds \n 1/2 tbsp dried minced onion \n salt and pepper to taste",
            "body": "Preheat oven to 350 degrees \n Spray a 9x13in casserole dish with cooking spray and set aside \n Use a serated knife to slice the rolls in half, leave the bottoms of the rolls in the bottom of the pan \n Add half of the cheese evenly on the rolls in the dish \n Add an even layer of ham, then top with the remaining cheese evenly \n Add the top half of the rolls \n Melt the butter, then set aside to slightly cool \n Wisk in the Worcestershire sauce, Dijon mustard, poppy seeds, minced onion, and salt and pepper to taste \n Pour the mixture over the rolls, using a pastry brush or spatula to evenly spread over top of the rolls \n Make sure the mixture falls to the bottom of the pan as well, you may not need all of the sauce mixture \n Cover the rolls with foil and bake for 20 minutes \n Remove the foil and bake for another 3-5 minutes (until tops are slightly crispy and the cheese is melted)",
            "description": "A fun twist on a ham sandwhich!",
            "cuisineId": 4
        }, {
            "id": 4,
            "title": "Garlic Butter Shrimp Pad Thai",
            "userId": 3,
            "ingredients": "8 oz wide rice noodles \n 3-4 tbsp low sodium soysauce (use more or less to taste) \n 2 tbsp fish sauce \n 2 tbsp white vinegar \n 3 tbsp honey\n 1 tsp chili flakes, plus more for serving \n 1 lb raw jumbo shrimp, peeled and deveined \n 3 tbsp peanut oil, or olive oil \n 4-6 garlic cloves finely chopped \n 3 tbsp salted butter \n 2-3 eggs beaten \n 2 cups bean sprouts, or chopped baby bok coy \n 4 green onions chopped, plus more for serving \n 1/4 cup roasted peanuts, chopped \n Thai or regular basil and limes,  for serving" ,
            "body": "Cook rice noodles according to package directions \n In a small bowl combine soy sauce, fish sauce, vinegar, honey, and chili flakes \n Heat the olive oil in a large skillet over medium heat \n Add the shrimp and sear on both sides until pink, 2-3 minutes \n Add the butter, garlic, black pepper and a pinch of chilli flakes \n Continue to cook the shrimp in the butter until the garlic begins to carmelize and turn golden brown \n Add the noodles to the sauce, tossing to combine for about 1 minute \n Push noodles to one side of the skillet and add the eggs to the other side \n Let eggs cook until the edges start to set, then roughly scramble and toss with noodles \n Remove from the heat, add the bean sprouts and green onions, tossing to combine \n Divide noodles and shrimp between plates, top with basil, lime juice, green onions, peanuts, and more chili flakes if desired ",
            "description": "Better than take out pad thai!",
            "cuisineId": 3
        }, {
            "id": 5,
            "title": "Chicken and Gnocchi Soup in the Crockpot",
            "userId": 3,
            "ingredients": "3-4 chicken breasts(diced into 1 inch pieces) \n 1 stalk of celery \n 1/2 white onion, diced \n 1 tbsp minced garlic \n 1/2 cup shredded carrots \n 4 cups of chicken broth \n 1 tsp salt, pepper, ground thyme \n 16oz of potato gnocchi \n 2 cups heavy whipping cream \n 1 tbsp corn starch \n 1 cup fresh chopped Spinach \n 1 cup shredded parmesean cheese",
            "body": "Place teh chicken, onion, celery, garlic, shredded carrots, salt, pepper, thyme, and chicken broth into the crock pot \n Cover and cook on low for 5-6 hours or on high for 3 hours \n Stir the cornstarch into the heavy whipping cream \n When chicken is fully cooked stir in the heavy cream mixture and the potato gnocchi \n Make sure the crockpot is on 'high', cover and cook for 15-30 minutes, or until the gnocchi is cooked through \n Turn off the crockpot, stir in the fresh spinach and parmesan, enjoy!",
            "description": "A knock off of Olive Garden's tastiest soup!",
            "cuisineId": 2
        }, {
            "id": 6,
            "title": "Crockpot BBQ Chicken",
            "userId": 3,
            "ingredients": "2lbs chicken breast \n 1.5 cups BBQ sauce (I prefer G Hughes sweet&spicy) \n 1/2 tsp onion powder and garlic powder \n 1 tsp chili powder \n 1 tbsp Worcestershire sauce \n 1 tbsp brown sugar \n Buns, coleslaw, etc for serving",
            "body": "Place the chicken breast in the crockpot \n Add the sauce and the seasonings together to a bowl and stir until smooth \n Pour the sauce over the chicken and toss to make sure it is well coated \n Cover and cook on high for 3-4 hours or low for 6-7 hours \n Once cooked, shred the chicken in the slow cooker using two forks, then stir so it is coated in the sauce \n Add salt and pepper to taste if needed before serving",
            "description": "A super simple weeknight meal that can be eaten a variety of ways!",
            "cuisineId":4
        }
    ],
    "cuisines" : [
        {
            "id": 1,
            "type": "Mexican"
        } , {
            
            "id": 2,
            "type": "Italian"
        }, {
            
            "id": 3,
            "type": "Thai"
        }, {
            
            "id": 4,
            "type": "American"
        }
    ],
    "userLikes" : [
        {
            "id": 1,
            "userId": 1,
            "postId": 2
        } , {
            "id": 2,
            "userId": 1,
            "postId": 3
        }, {
            "id": 3,
            "userId": 2,
            "postId": 3
        }, {
            "id": 4,
            "userId": 2,
            "postId": 1
        }, {
            "id": 5,
            "userId": 2,
            "postId": 4
        }, {
            "id": 6,
            "userId": 1,
            "postId": 5
        }, {
            "id": 7,
            "userId": 2,
            "postId": 6
        }
    ]

}
